[
  {
    "id": "introProgrammingQ1",
    "front": "What is a computer program?",
    "back": "A set of instructions that a computer follows to perform tasks."
  },
  {
    "id": "introProgrammingQ2",
    "front": "What is a programming language?",
    "back": "A formal language used to write computer programs that can be understood and executed by computers."
  },
  {
    "id": "introProgrammingQ3",
    "front": "What is the role of a compiler?",
    "back": "A compiler translates high-level programming code into machine code that can be executed by a computer."
  },
  {
    "id": "introProgrammingQ4",
    "front": "What is the difference between source code and machine code?",
    "back": "Source code is written by humans in a programming language; machine code is the binary code that a computer's processor understands and executes."
  },
  {
    "id": "introProgrammingQ5",
    "front": "What is an algorithm?",
    "back": "A step-by-step procedure to solve a problem or perform a task."
  },
  {
    "id": "introProgrammingQ6",
    "front": "What is the basic structure of a C program?",
    "back": "A C program typically includes a header section, a main function, and the program code inside the main function."
  }
{
  "id": "introProgrammingQ7",
  "front": "What are the basic data types in C?",
  "back": "int, float, double, and char."
},
{
  "id": "introProgrammingQ8",
  "front": "What is the purpose of the 'main' function in C?",
  "back": "It is the entry point of every C program where execution begins."
},
{
  "id": "introProgrammingQ9",
  "front": "What does 'syntax' refer to in programming?",
  "back": "The set of rules that defines the combinations of symbols that are considered valid code in a programming language."
},
{
  "id": "introProgrammingQ10",
  "front": "What is an integrated development environment (IDE)?",
  "back": "A software suite that provides tools for writing, testing, and debugging programs, like Visual Studio Code or Eclipse."
},
{
  "id": "introProgrammingQ11",
  "front": "What is a variable?",
  "back": "A storage location identified by a name that holds data which can be changed during program execution."
},
{
  "id": "introProgrammingQ12",
  "front": "What is the difference between a 'syntax error' and a 'runtime error'?",
  "back": "A syntax error occurs when code violates language rules and won't compile, while a runtime error occurs during program execution and causes it to crash."
},
{
  "id": "introProgrammingQ13",
  "front": "What is the purpose of comments in code?",
  "back": "Comments are notes in the code ignored by the compiler, used to explain what the code does or to leave reminders for the programmer."
},
{
  "id": "introProgrammingQ14",
  "front": "What is the role of the 'printf' function in C?",
  "back": "'printf' is used to output text to the console or terminal."
}
]
